jwvance/Hummingbird/Hummingbird(Continuous Output).cydsn/Generated_Source/PSoC5/TIMER_TUNER.h
/*******************************************************************************
* File Name: TIMER_TUNER.h
* Version 2.70
*
*  Description:
*     Contains the function prototypes and constants available to the timer
*     user module.
*
*   Note:
*     None
*
********************************************************************************
* Copyright 2008-2014, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
********************************************************************************/

#if !defined(CY_Timer_v2_60_TIMER_TUNER_H)
#define CY_Timer_v2_60_TIMER_TUNER_H

#include "cytypes.h"
#include "cyfitter.h"
#include "CyLib.h" /* For CyEnterCriticalSection() and CyExitCriticalSection() functions */

extern uint8 TIMER_TUNER_initVar;

/* Check to see if required defines such as CY_PSOC5LP are available */
/* They are defined starting with cy_boot v3.0 */
#if !defined (CY_PSOC5LP)
    #error Component Timer_v2_70 requires cy_boot v3.0 or later
#endif /* (CY_ PSOC5LP) */


/**************************************
*           Parameter Defaults
**************************************/

#define TIMER_TUNER_Resolution                 24u
#define TIMER_TUNER_UsingFixedFunction         0u
#define TIMER_TUNER_UsingHWCaptureCounter      0u
#define TIMER_TUNER_SoftwareCaptureMode        0u
#define TIMER_TUNER_SoftwareTriggerMode        0u
#define TIMER_TUNER_UsingHWEnable              0u
#define TIMER_TUNER_EnableTriggerMode          0u
#define TIMER_TUNER_InterruptOnCaptureCount    0u
#define TIMER_TUNER_RunModeUsed                0u
#define TIMER_TUNER_ControlRegRemoved          0u

#if defined(TIMER_TUNER_TimerUDB_sCTRLReg_SyncCtl_ctrlreg__CONTROL_REG)
    #define TIMER_TUNER_UDB_CONTROL_REG_REMOVED            (0u)
#elif  (TIMER_TUNER_UsingFixedFunction)
    #define TIMER_TUNER_UDB_CONTROL_REG_REMOVED            (0u)
#else 
    #define TIMER_TUNER_UDB_CONTROL_REG_REMOVED            (1u)
#endif /* End TIMER_TUNER_TimerUDB_sCTRLReg_SyncCtl_ctrlreg__CONTROL_REG */


/***************************************
*       Type defines
***************************************/


/**************************************************************************
 * Sleep Wakeup Backup structure for Timer Component
 *************************************************************************/
typedef struct
{
    uint8 TimerEnableState;
    #if(!TIMER_TUNER_UsingFixedFunction)

        uint32 TimerUdb;
        uint8 InterruptMaskValue;
        #if (TIMER_TUNER_UsingHWCaptureCounter)
            uint8 TimerCaptureCounter;
        #endif /* variable declarations for backing up non retention registers in CY_UDB_V1 */

        #if (!TIMER_TUNER_UDB_CONTROL_REG_REMOVED)
            uint8 TimerControlRegister;
        #endif /* variable declaration for backing up enable state of the Timer */
    #endif /* define backup variables only for UDB implementation. Fixed function registers are all retention */

}TIMER_TUNER_backupStruct;


/***************************************
*       Function Prototypes
***************************************/

void    TIMER_TUNER_Start(void) ;
void    TIMER_TUNER_Stop(void) ;

void    TIMER_TUNER_SetInterruptMode(uint8 interruptMode) ;
uint8   TIMER_TUNER_ReadStatusRegister(void) ;
/* Deprecated function. Do not use this in future. Retained for backward compatibility */
#define TIMER_TUNER_GetInterruptSource() TIMER_TUNER_ReadStatusRegister()

#if(!TIMER_TUNER_UDB_CONTROL_REG_REMOVED)
    uint8   TIMER_TUNER_ReadControlRegister(void) ;
    void    TIMER_TUNER_WriteControlRegister(uint8 control) ;
#endif /* (!TIMER_TUNER_UDB_CONTROL_REG_REMOVED) */

uint32  TIMER_TUNER_ReadPeriod(void) ;
void    TIMER_TUNER_WritePeriod(uint32 period) ;
uint32  TIMER_TUNER_ReadCounter(void) ;
void    TIMER_TUNER_WriteCounter(uint32 counter) ;
uint32  TIMER_TUNER_ReadCapture(void) ;
void    TIMER_TUNER_SoftwareCapture(void) ;

#if(!TIMER_TUNER_UsingFixedFunction) /* UDB Prototypes */
    #if (TIMER_TUNER_SoftwareCaptureMode)
        void    TIMER_TUNER_SetCaptureMode(uint8 captureMode) ;
    #endif /* (!TIMER_TUNER_UsingFixedFunction) */

    #if (TIMER_TUNER_SoftwareTriggerMode)
        void    TIMER_TUNER_SetTriggerMode(uint8 triggerMode) ;
    #endif /* (TIMER_TUNER_SoftwareTriggerMode) */

    #if (TIMER_TUNER_EnableTriggerMode)
        void    TIMER_TUNER_EnableTrigger(void) ;
        void    TIMER_TUNER_DisableTrigger(void) ;
    #endif /* (TIMER_TUNER_EnableTriggerMode) */


    #if(TIMER_TUNER_InterruptOnCaptureCount)
        void    TIMER_TUNER_SetInterruptCount(uint8 interruptCount) ;
    #endif /* (TIMER_TUNER_InterruptOnCaptureCount) */

    #if (TIMER_TUNER_UsingHWCaptureCounter)
        void    TIMER_TUNER_SetCaptureCount(uint8 captureCount) ;
        uint8   TIMER_TUNER_ReadCaptureCount(void) ;
    #endif /* (TIMER_TUNER_UsingHWCaptureCounter) */

    void TIMER_TUNER_ClearFIFO(void) ;
#endif /* UDB Prototypes */

/* Sleep Retention APIs */
void TIMER_TUNER_Init(void)          ;
void TIMER_TUNER_Enable(void)        ;
void TIMER_TUNER_SaveConfig(void)    ;
void TIMER_TUNER_RestoreConfig(void) ;
void TIMER_TUNER_Sleep(void)         ;
void TIMER_TUNER_Wakeup(void)        ;


/***************************************
*   Enumerated Types and Parameters
***************************************/

/* Enumerated Type B_Timer__CaptureModes, Used in Capture Mode */
#define TIMER_TUNER__B_TIMER__CM_NONE 0
#define TIMER_TUNER__B_TIMER__CM_RISINGEDGE 1
#define TIMER_TUNER__B_TIMER__CM_FALLINGEDGE 2
#define TIMER_TUNER__B_TIMER__CM_EITHEREDGE 3
#define TIMER_TUNER__B_TIMER__CM_SOFTWARE 4



/* Enumerated Type B_Timer__TriggerModes, Used in Trigger Mode */
#define TIMER_TUNER__B_TIMER__TM_NONE 0x00u
#define TIMER_TUNER__B_TIMER__TM_RISINGEDGE 0x04u
#define TIMER_TUNER__B_TIMER__TM_FALLINGEDGE 0x08u
#define TIMER_TUNER__B_TIMER__TM_EITHEREDGE 0x0Cu
#define TIMER_TUNER__B_TIMER__TM_SOFTWARE 0x10u


