jwvance/Hummingbird/Hummingbird(Continuous Output).cydsn/Generated_Source/PSoC5/TIMER_TUNER.h
    /***************************************
    *           UDB Registers
    ***************************************/

    #define TIMER_TUNER_STATUS              (* (reg8 *) TIMER_TUNER_TimerUDB_rstSts_stsreg__STATUS_REG )
    #define TIMER_TUNER_STATUS_MASK         (* (reg8 *) TIMER_TUNER_TimerUDB_rstSts_stsreg__MASK_REG)
    #define TIMER_TUNER_STATUS_AUX_CTRL     (* (reg8 *) TIMER_TUNER_TimerUDB_rstSts_stsreg__STATUS_AUX_CTL_REG)
    #define TIMER_TUNER_CONTROL             (* (reg8 *) TIMER_TUNER_TimerUDB_sCTRLReg_SyncCtl_ctrlreg__CONTROL_REG )
    
    #if(TIMER_TUNER_Resolution <= 8u) /* 8-bit Timer */
        #define TIMER_TUNER_CAPTURE_LSB         (* (reg8 *) TIMER_TUNER_TimerUDB_sT24_timerdp_u0__F0_REG )
        #define TIMER_TUNER_CAPTURE_LSB_PTR       ((reg8 *) TIMER_TUNER_TimerUDB_sT24_timerdp_u0__F0_REG )
        #define TIMER_TUNER_PERIOD_LSB          (* (reg8 *) TIMER_TUNER_TimerUDB_sT24_timerdp_u0__D0_REG )
        #define TIMER_TUNER_PERIOD_LSB_PTR        ((reg8 *) TIMER_TUNER_TimerUDB_sT24_timerdp_u0__D0_REG )
        #define TIMER_TUNER_COUNTER_LSB         (* (reg8 *) TIMER_TUNER_TimerUDB_sT24_timerdp_u0__A0_REG )
        #define TIMER_TUNER_COUNTER_LSB_PTR       ((reg8 *) TIMER_TUNER_TimerUDB_sT24_timerdp_u0__A0_REG )
    #elif(TIMER_TUNER_Resolution <= 16u) /* 8-bit Timer */
        #if(CY_PSOC3) /* 8-bit addres space */
            #define TIMER_TUNER_CAPTURE_LSB         (* (reg16 *) TIMER_TUNER_TimerUDB_sT24_timerdp_u0__F0_REG )
            #define TIMER_TUNER_CAPTURE_LSB_PTR       ((reg16 *) TIMER_TUNER_TimerUDB_sT24_timerdp_u0__F0_REG )
            #define TIMER_TUNER_PERIOD_LSB          (* (reg16 *) TIMER_TUNER_TimerUDB_sT24_timerdp_u0__D0_REG )
            #define TIMER_TUNER_PERIOD_LSB_PTR        ((reg16 *) TIMER_TUNER_TimerUDB_sT24_timerdp_u0__D0_REG )
            #define TIMER_TUNER_COUNTER_LSB         (* (reg16 *) TIMER_TUNER_TimerUDB_sT24_timerdp_u0__A0_REG )
            #define TIMER_TUNER_COUNTER_LSB_PTR       ((reg16 *) TIMER_TUNER_TimerUDB_sT24_timerdp_u0__A0_REG )
        #else /* 16-bit address space */
            #define TIMER_TUNER_CAPTURE_LSB         (* (reg16 *) TIMER_TUNER_TimerUDB_sT24_timerdp_u0__16BIT_F0_REG )
            #define TIMER_TUNER_CAPTURE_LSB_PTR       ((reg16 *) TIMER_TUNER_TimerUDB_sT24_timerdp_u0__16BIT_F0_REG )
            #define TIMER_TUNER_PERIOD_LSB          (* (reg16 *) TIMER_TUNER_TimerUDB_sT24_timerdp_u0__16BIT_D0_REG )
            #define TIMER_TUNER_PERIOD_LSB_PTR        ((reg16 *) TIMER_TUNER_TimerUDB_sT24_timerdp_u0__16BIT_D0_REG )
            #define TIMER_TUNER_COUNTER_LSB         (* (reg16 *) TIMER_TUNER_TimerUDB_sT24_timerdp_u0__16BIT_A0_REG )
            #define TIMER_TUNER_COUNTER_LSB_PTR       ((reg16 *) TIMER_TUNER_TimerUDB_sT24_timerdp_u0__16BIT_A0_REG )
        #endif /* CY_PSOC3 */
    #elif(TIMER_TUNER_Resolution <= 24u)/* 24-bit Timer */
        #define TIMER_TUNER_CAPTURE_LSB         (* (reg32 *) TIMER_TUNER_TimerUDB_sT24_timerdp_u0__F0_REG )
        #define TIMER_TUNER_CAPTURE_LSB_PTR       ((reg32 *) TIMER_TUNER_TimerUDB_sT24_timerdp_u0__F0_REG )
        #define TIMER_TUNER_PERIOD_LSB          (* (reg32 *) TIMER_TUNER_TimerUDB_sT24_timerdp_u0__D0_REG )
        #define TIMER_TUNER_PERIOD_LSB_PTR        ((reg32 *) TIMER_TUNER_TimerUDB_sT24_timerdp_u0__D0_REG )
        #define TIMER_TUNER_COUNTER_LSB         (* (reg32 *) TIMER_TUNER_TimerUDB_sT24_timerdp_u0__A0_REG )
        #define TIMER_TUNER_COUNTER_LSB_PTR       ((reg32 *) TIMER_TUNER_TimerUDB_sT24_timerdp_u0__A0_REG )
    #else /* 32-bit Timer */
        #if(CY_PSOC3 || CY_PSOC5) /* 8-bit address space */
            #define TIMER_TUNER_CAPTURE_LSB         (* (reg32 *) TIMER_TUNER_TimerUDB_sT24_timerdp_u0__F0_REG )
            #define TIMER_TUNER_CAPTURE_LSB_PTR       ((reg32 *) TIMER_TUNER_TimerUDB_sT24_timerdp_u0__F0_REG )
            #define TIMER_TUNER_PERIOD_LSB          (* (reg32 *) TIMER_TUNER_TimerUDB_sT24_timerdp_u0__D0_REG )
            #define TIMER_TUNER_PERIOD_LSB_PTR        ((reg32 *) TIMER_TUNER_TimerUDB_sT24_timerdp_u0__D0_REG )
            #define TIMER_TUNER_COUNTER_LSB         (* (reg32 *) TIMER_TUNER_TimerUDB_sT24_timerdp_u0__A0_REG )
            #define TIMER_TUNER_COUNTER_LSB_PTR       ((reg32 *) TIMER_TUNER_TimerUDB_sT24_timerdp_u0__A0_REG )
        #else /* 32-bit address space */
            #define TIMER_TUNER_CAPTURE_LSB         (* (reg32 *) TIMER_TUNER_TimerUDB_sT24_timerdp_u0__32BIT_F0_REG )
            #define TIMER_TUNER_CAPTURE_LSB_PTR       ((reg32 *) TIMER_TUNER_TimerUDB_sT24_timerdp_u0__32BIT_F0_REG )
            #define TIMER_TUNER_PERIOD_LSB          (* (reg32 *) TIMER_TUNER_TimerUDB_sT24_timerdp_u0__32BIT_D0_REG )
            #define TIMER_TUNER_PERIOD_LSB_PTR        ((reg32 *) TIMER_TUNER_TimerUDB_sT24_timerdp_u0__32BIT_D0_REG )
            #define TIMER_TUNER_COUNTER_LSB         (* (reg32 *) TIMER_TUNER_TimerUDB_sT24_timerdp_u0__32BIT_A0_REG )
            #define TIMER_TUNER_COUNTER_LSB_PTR       ((reg32 *) TIMER_TUNER_TimerUDB_sT24_timerdp_u0__32BIT_A0_REG )
        #endif /* CY_PSOC3 || CY_PSOC5 */ 
    #endif

    #define TIMER_TUNER_COUNTER_LSB_PTR_8BIT       ((reg8 *) TIMER_TUNER_TimerUDB_sT24_timerdp_u0__A0_REG )
    
    #if (TIMER_TUNER_UsingHWCaptureCounter)
        #define TIMER_TUNER_CAP_COUNT              (*(reg8 *) TIMER_TUNER_TimerUDB_sCapCount_counter__PERIOD_REG )
        #define TIMER_TUNER_CAP_COUNT_PTR          ( (reg8 *) TIMER_TUNER_TimerUDB_sCapCount_counter__PERIOD_REG )
        #define TIMER_TUNER_CAPTURE_COUNT_CTRL     (*(reg8 *) TIMER_TUNER_TimerUDB_sCapCount_counter__CONTROL_AUX_CTL_REG )
        #define TIMER_TUNER_CAPTURE_COUNT_CTRL_PTR ( (reg8 *) TIMER_TUNER_TimerUDB_sCapCount_counter__CONTROL_AUX_CTL_REG )
    #endif /* (TIMER_TUNER_UsingHWCaptureCounter) */


    /***************************************
    *       Register Constants
    ***************************************/

    /* Control Register Bit Locations */
    #define TIMER_TUNER_CTRL_INTCNT_SHIFT              0x00u       /* As defined by Verilog Implementation */
    #define TIMER_TUNER_CTRL_TRIG_MODE_SHIFT           0x02u       /* As defined by Verilog Implementation */
    #define TIMER_TUNER_CTRL_TRIG_EN_SHIFT             0x04u       /* As defined by Verilog Implementation */
    #define TIMER_TUNER_CTRL_CAP_MODE_SHIFT            0x05u       /* As defined by Verilog Implementation */
    #define TIMER_TUNER_CTRL_ENABLE_SHIFT              0x07u       /* As defined by Verilog Implementation */

    /* Control Register Bit Masks */
    #define TIMER_TUNER_CTRL_INTCNT_MASK               ((uint8)((uint8)0x03u << TIMER_TUNER_CTRL_INTCNT_SHIFT))
    #define TIMER_TUNER_CTRL_TRIG_MODE_MASK            ((uint8)((uint8)0x03u << TIMER_TUNER_CTRL_TRIG_MODE_SHIFT))
    #define TIMER_TUNER_CTRL_TRIG_EN                   ((uint8)((uint8)0x01u << TIMER_TUNER_CTRL_TRIG_EN_SHIFT))
    #define TIMER_TUNER_CTRL_CAP_MODE_MASK             ((uint8)((uint8)0x03u << TIMER_TUNER_CTRL_CAP_MODE_SHIFT))
    #define TIMER_TUNER_CTRL_ENABLE                    ((uint8)((uint8)0x01u << TIMER_TUNER_CTRL_ENABLE_SHIFT))

